package com.crafthub.order_service.entity;

public enum OrderStatus {
    // 🟡 Етап оформлення
    CREATED,            // Замовлення створене, товари зарезервовані, але оплата ще не почалася
    PENDING_PAYMENT,    // Користувач перейшов на сторінку оплати (транзакція створена)

    // 🟢 Етап успіху
    PAID,               // Оплата пройшла успішно (Payment Service підтвердив)
    PREPARING,          // Продавець прийняв замовлення в роботу (пакує)
    SHIPPED,            // Передано в службу доставки
    DELIVERED,          // Успішно доставлено покупцю

    // 🔴 Етап скасування/помилок
    PAYMENT_FAILED,     // Банк відхилив оплату (недостатньо коштів, помилка картки)
    CANCELLED,          // Скасовано користувачем або менеджером (до відправки)
    REFUNDED            // Гроші повернуто покупцю (наприклад, після скасування оплаченого товару)
}